[
  {
    "title": "Midsommar Nordic Feast",
    "slug": "midsommar-feast-2026",
    "date": "2026-06-20",
    "time": "18:00",
    "endTime": "22:00",
    "location": "The Nordic Deli, Shop 15/10 Santa Barbara Rd, Hope Island QLD 4212",
    "description": "Join us for a magical Midsummer celebration — a long Nordic feast table, traditional Scandinavian dishes, and the warmth of Hygge under the stars. Limited to 24 guests.",
    "price": 95,
    "seats": 24,
    "status": "available",
    "content": "Midsommar — the Swedish celebration of the summer solstice — is one of the most cherished occasions in Scandinavian culture. At The Nordic Deli, we are bringing this beloved tradition to Hope Island with a long-table feast that captures everything wonderful about the Nordic summer: abundance, warmth, community, and the simple joy of gathering around beautiful food.\n\nOur Midsommar feast will take you on a culinary journey through classic Swedish and Nordic flavours. Think house-cured gravlax with dill crème fraîche, new potato salad with chives and mustard vinaigrette, slow-roasted lamb with lingonberry jus, freshly baked rye bread, and traditional elderflower drinks to toast the longest day of the year. We will close the evening with a traditional Swedish midsommar cake — a layered cream and berry celebration finished with the season's freshest strawberries.\n\nSeats are strictly limited to 24 guests to preserve the intimate atmosphere that makes Hygge so special. Drinks packages are available for pre-purchase. This event sells out every year — we encourage you to secure your place early. Please contact us to let us know of any dietary requirements so we can ensure every guest is well looked after."
  },
  {
    "title": "Nordic Baking Masterclass: Kanelsnurre",
    "slug": "baking-class-2026",
    "date": "2026-04-12",
    "time": "10:00",
    "endTime": "13:00",
    "location": "The Nordic Deli, Shop 15/10 Santa Barbara Rd, Hope Island QLD 4212",
    "description": "Learn the art of the Norwegian kanelsnurre — a beautifully twisted cinnamon scroll that is as satisfying to make as it is to eat. Hands-on class for all skill levels. Includes morning tea and a box of your own bakes to take home.",
    "price": 85,
    "seats": 12,
    "status": "available",
    "content": "The kanelsnurre — the Norwegian twisted cinnamon scroll — is one of the most beloved pastries in all of Scandinavia. Unlike its flatter cousins, the kanelsnurre is characterised by its dramatic spiral shape, deeply spiced cardamom and cinnamon filling, and its signature pearl sugar topping that caramelises to a perfect crunch in the oven. In this hands-on three-hour masterclass, our head baker will guide you through every stage of the process: from building a pillowy enriched dough to mastering the twisting technique that gives these pastries their signature look.\n\nYou will leave with not only the skills to recreate these at home, but also a box of a dozen freshly baked kanelsnurre to share with family and friends. Morning tea is included, featuring a selection of our house-made pastries and freshly brewed Nordic coffee. This class is designed for all skill levels — whether you are a complete beginner or an experienced home baker looking to add something new to your repertoire. Class sizes are kept small (maximum 12 participants) to ensure personal instruction and a relaxed, enjoyable atmosphere. Please advise us of any dietary requirements at time of booking."
  }
]
